tutorials/transport/multiSpeciesTransportFoam/Ketton/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        tolerance        1e-9;
        relTol           0.1;
        smoother         GaussSeidel;
        nPreSweeps       0;
        nPostSweeps      2;
        cacheAgglomeration on;
        agglomerator     faceAreaPair;
        nCellsInCoarsestLevel 10;
        mergeLevels      1;
    }
    U
    {
        solver           smoothSolver;
        smoother         GaussSeidel;
        tolerance        1e-9;
        relTol           0.1;
        nSweeps          1;
    }

    Yi 
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }

    YiFinal
    {
       $Yi
       relTol 0;
    }

}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;

        residualControl
        {
                p               1e-7;
                U               1e-7;
        }

}

relaxationFactors
{
    equations
    {
       p               0.3;
       U               0.3;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
